

local __rs={
[1]="很遗憾，俘虏<color=#97684e>%s</color>蓄谋越狱已久，一直未被发觉，今趁狱卒不备，已成功逃脱",
[2]="弟子<color=#81ab60>%s</color>通过再三审问，成功从犯人<color=#97684e>%s</color>处获得%s的下落，果然借此线索成功寻得此物",
[3]="弟子<color=#81ab60>%s</color>凭三寸不烂之舌，成功说服<color=#97684e>%s</color>加入我宗，从此归心，不作他想",
[4]="祖师大发慈悲，决定释放<color=#97684e>%s</color>，此人留着也无大用，不如早点放了",
[5]="已成功将犯人<color=#97684e>%s</color>流放至虚空之中，如无意外，世间再无此人了",
[6]="经过再三考虑，最终决定将<color=#97684e>%s</color>上交至九渊，从而获得了%s",
[7]="经过再三考虑，最终决定将魔物<color=#97684e>%s</color>上交至九渊，从而获得了%s",
[8]="很遗憾，魔物 <color=#97684e>%s</color>趁长老不备，成功逃脱",
[9]="<color=#97684e>%s</color>弟子通过强烈手段镇压，成功从魔物<color=#97684e>%s</color>获得了%s",
[10]="祖师大发慈悲，决定释放魔物<color=#97684e>%s</color>，上天亦有好生之德",
[11]="<color=#97684e>%s</color>弟子通过镇压魔物<color=#97684e>%s</color>期间，获得了特质<color=#97684e>%s</color>",
}
local ___noname___=
{
{
id=1,
log=__rs[1]
},
{
id=2,
log=__rs[2]
},
{
id=3,
log=__rs[3]
},
{
id=4,
log=__rs[4]
},
{
id=5,
log=__rs[5]
},
{
id=6,
log=__rs[6]
},
[101]={
id=101,
log=__rs[7]
},
[102]={
id=102,
log=__rs[8]
},
[103]={
id=103,
log=__rs[9]
},
[104]={
id=104,
log=__rs[10]
},
[105]={
id=105,
log=__rs[11]
}
}

return ___noname___
