

local __rs={
[1]="使宗门所有{0}产量+{1}%",
[2]="自身所在{0}产量+{1}%",
[3]="弟子每1点{1}可提升所在{0}产量{2}%",
[4]="弟子所在{0}生产时有{1}%概率获得双倍特产",
[5]="弟子所在{0}生产时有概率获得“金司晨的杂物匣”，可获得随机炼器宝材，每日最多{6}次\n<color=#CCCCFF>· 今日已获得：{7}次</color>\n\n各方案获取概率\n· 生产方案1：{1}%\n· 生产方案2：{2}%\n· 生产方案3：{3}%\n· 生产方案4：{4}%",
[6]="弟子所在{0}生产时有概率获得“金司晨的杂物匣”，可获得随机炼器宝材，每日最多{6}次\n\n· 生产方案1：{1}%\n· 生产方案2：{2}%\n· 生产方案3：{3}%\n· 生产方案4：{4}%",
[7]="弟子所在{0}生产时有概率获得“灵植袋子”，每日最多{6}次\n<color=#CCCCFF>· 今日已获得：{7}次</color>\n\n各方案获取概率\n· 生产方案1：{1}%\n· 生产方案2：{2}%\n· 生产方案3：{3}%\n· 生产方案4：{4}%",
[8]="弟子所在{0}生产时有概率获得“灵植袋子”，每日最多{6}次\n\n· 生产方案1：{1}%\n· 生产方案2：{2}%\n· 生产方案3：{3}%\n· 生产方案4：{4}%",
[9]="使宗门所有弟子服用修为丹时获取修为+{0}%，饱食度降低{1}%",
[10]="使宗门所有弟子服用炼体丹时获取炼体经验+{0}%",
[11]="弟子所在的{0}每炼制1炉丹药有{1}%概率获得“鹿鸣药匣”，每日最多获得{4}次\n<color=#CCCCFF>· 今日已获得：{5}次</color>",
[12]="弟子所在{0}炼制丹药时有{1}%概率获得“鹿鸣药匣”，每日最多获得{4}次",
[13]="弟子所在{0}炼制丹药效率提升{1}%",
}
local ___noname___=
{
{
desc=__rs[1],
desc2=__rs[1],
id=1
},
{
desc=__rs[2],
desc2=__rs[2],
id=2
},
{
desc=__rs[3],
desc2=__rs[3],
id=3
},
{
desc=__rs[4],
desc2=__rs[4],
id=4
},
{
desc=__rs[5],
desc2=__rs[6],
id=5
},
{
desc=__rs[7],
desc2=__rs[8],
id=6
},
{
desc=__rs[9],
desc2=__rs[9],
id=7
},
{
desc=__rs[10],
desc2=__rs[10],
id=8
},
{
desc=__rs[11],
desc2=__rs[12],
id=9
},
{
desc=__rs[13],
desc2=__rs[13],
id=10
}
}

return ___noname___
