

local __rs={
[1]="双方速战<color=#549327>{0}回合</color>，{1}队伍轻松获胜",
[2]="双方鏖战<color=#549327>{0}回合</color>，{1}队伍艰难获胜",
[3]="躲得妙！",
[4]="这招绝！",
[5]="小心！",
[6]="稳住！",
[7]="有破绽！",
[8]="精彩！",
[9]="这都行？",
[10]="回马枪！",
[11]="借力打力！",
[12]="移形换位！",
[13]="转守为攻！",
[14]="先发制人！",
[15]="避其锋芒！",
[16]="攻其不备！",
[17]="后发先至！",
[18]="闪转腾挪！",
}
local ___noname___=
{
{
cd=3,
id=1,
maxSpeakCount=2,
monster_group_id=196001,
settlementStr={
{
1,
10,
__rs[1]
},
{
11,
20,
__rs[2]
}
},
spectatorCount=8,
spectatorSpeakStr={
__rs[3],
__rs[4],
__rs[5],
__rs[6],
__rs[7],
__rs[8],
__rs[9],
__rs[10],
__rs[11],
__rs[12],
__rs[13],
__rs[13],
__rs[14],
__rs[15],
__rs[16],
__rs[17],
__rs[18]
}
}
}

return ___noname___
