

local __rs={
[1]="九域试剑锋，执掌乾坤赏！参与九域争锋，争夺仙域排名提升段位，赢取豪礼!",
[2]="九域争锋分为四个段位，由低到高依次为：末法绝域、灵秀苍域、道玄正域、星穹圣域。每次仙界重组后，根据段位匹配实力相近的仙域进入同一仙界。",
[3]="在仙界中，获取积分争夺仙域排名，提升段位，赢取段位+排名双重奖励。段位越高，排名越靠前，奖励越丰厚！首轮争锋为段位定级赛。根据首次争锋中的排名，决定仙域的段位。",
[4]="除首次争锋后，每次仙界重组前结束九域争锋，根据仙域积分排名，上升或下降仙域段位；仙界重组后，积分清零，重新开启仙域排名争夺。",
[5]="积分获取方式：祖师在多种玩法中，均可获取仙域积分。具体为：",
[6]="击破仙墟说明：仅在仙墟奖励次数未用尽时击破仙墟，才能获得仙域积分。",
[7]="问鼎苍穹、仙界伏魔分组说明：仅可以通过仙域参与的最高组别排名获得积分。",
[8]="问鼎苍穹-帝君组排名",
[9]="冠军 <color=#ca631d>2000000</color> 积分",
[10]="亚军 <color=#ca631d>1200000</color> 积分",
[11]="季军 <color=#ca631d>800000</color> 积分",
[12]="问鼎苍穹-天尊组排名",
[13]="冠军 <color=#ca631d>600000</color> 积分",
[14]="亚军 <color=#ca631d>400000</color> 积分",
[15]="季军 <color=#ca631d>200000</color> 积分",
[16]="星域争夺战-排名",
[17]="冠军 <color=#ca631d>450000</color> 积分",
[18]="亚军 <color=#ca631d>225000</color> 积分",
[19]="天外降魔(45-49)-排名",
[20]="第1~3名 <color=#ca631d>3000</color> 积分",
[21]="第4~10名 <color=#ca631d>1500</color> 积分",
[22]="天外降魔(50-54)-排名",
[23]="第1~3名 <color=#ca631d>10000</color> 积分",
[24]="第4~10名 <color=#ca631d>5000</color> 积分",
[25]="演武台-战绩榜排名",
[26]="第1名 <color=#ca631d>100000</color> 积分",
[27]="第2名 <color=#ca631d>50000</color> 积分",
[28]="第3名 <color=#ca631d>25000</color>积分",
[29]="第4~5名 <color=#ca631d>12000</color> 积分",
[30]="第6~10名 <color=#ca631d>6000</color> 积分",
[31]="演武台-战陨榜排名",
[32]="第1名 <color=#ca631d>50000</color> 积分",
[33]="第2名 <color=#ca631d>25000</color> 积分",
[34]="第3名 <color=#ca631d>12000</color>积分",
[35]="第4~5名 <color=#ca631d>6000</color> 积分",
[36]="第6~10名 <color=#ca631d>3000</color> 积分",
[37]="驻守演武台时间",
[38]="每驻守演武台 <color=#ca631d>1</color> 秒= <color=#ca631d>6</color> 积分",
[39]="仙界-击破仙墟",
[40]="<color=#ca631d>1</color> 阶 = <color=#ca631d>20</color> 积分",
[41]="<color=#ca631d>2</color> 阶 = <color=#ca631d>23</color> 积分",
[42]="<color=#ca631d>3</color> 阶 = <color=#ca631d>26</color> 积分",
[43]="<color=#ca631d>4</color> 阶 = <color=#ca631d>29</color> 积分",
[44]="<color=#ca631d>5</color> 阶 = <color=#ca631d>32</color> 积分",
[45]="<color=#ca631d>6</color> 阶 = <color=#ca631d>35</color> 积分",
[46]="<color=#ca631d>7</color> 阶 = <color=#ca631d>38</color> 积分",
[47]="<color=#ca631d>8</color> 阶 = <color=#ca631d>41</color> 积分",
[48]="<color=#ca631d>9</color> 阶 = <color=#ca631d>44</color> 积分",
[49]="<color=#ca631d>10</color> 阶 = <color=#ca631d>47</color> 积分",
[50]="<color=#ca631d>11</color> 阶 = <color=#ca631d>50</color> 积分",
[51]="<color=#ca631d>12</color> 阶 = <color=#ca631d>53</color> 积分",
[52]="<color=#ca631d>13</color> 阶 = <color=#ca631d>56</color> 积分",
[53]="<color=#ca631d>14</color> 阶 = <color=#ca631d>59</color> 积分",
[54]="<color=#ca631d>15</color> 阶 = <color=#ca631d>62</color> 积分",
[55]="<color=#ca631d>16</color> 阶 = <color=#ca631d>65</color> 积分",
[56]="<color=#ca631d>17</color> 阶 = <color=#ca631d>68</color> 积分",
[57]="<color=#ca631d>18</color> 阶 = <color=#ca631d>71</color> 积分",
[58]="<color=#ca631d>19</color> 阶 = <color=#ca631d>74</color> 积分",
[59]="<color=#ca631d>20</color> 阶 = <color=#ca631d>77</color> 积分",
}
local __r_1={
16021,
100
}
local __r_2={
21002,
100
}
local __r_3={
16021,
90
}
local __r_4={
21002,
90
}
local __r_5={
16021,
80
}
local __r_6={
21002,
80
}
local __r_7={
16021,
70
}
local __r_8={
21002,
70
}
local __r_9={
16021,
65
}
local __r_10={
21002,
65
}
local __r_11={
16021,
45
}
local __r_12={
21002,
45
}
local __r_13={
16021,
40
}
local __r_14={
21002,
40
}
local __r_15={
"2026-2-8 23:30:00",
"2026-2-8 23:59:00"
}
local ___noname___=
{
{
daily_update_time={
{
5,
30
},
{
6,
0
}
},
first_level_conf={
{
1,
25
},
{
2,
25
},
{
3,
25
},
{
4,
25
}
},
first_rank_reward={
{
1,
1,
{
{
21672,
100
},
{
139,
10000
},
__r_1,
__r_2
}
},
{
2,
2,
{
{
21672,
95
},
{
139,
9500
},
__r_1,
__r_2
}
},
{
3,
3,
{
{
21672,
90
},
{
139,
9000
},
__r_1,
__r_2
}
},
{
4,
5,
{
{
21672,
85
},
{
139,
8500
},
__r_3,
__r_4
}
},
{
6,
10,
{
{
21672,
80
},
{
139,
8000
},
__r_3,
__r_4
}
},
{
11,
20,
{
{
21672,
75
},
{
139,
7500
},
__r_3,
__r_4
}
},
{
21,
30,
{
{
21672,
70
},
{
139,
7000
},
__r_5,
__r_6
}
},
{
31,
40,
{
{
21672,
65
},
{
139,
6500
},
__r_5,
__r_6
}
},
{
41,
50,
{
{
21672,
60
},
{
139,
6000
},
__r_7,
__r_8
}
},
{
51,
60,
{
{
21672,
55
},
{
139,
5500
},
__r_7,
__r_8
}
},
{
61,
70,
{
{
21672,
50
},
{
139,
5000
},
__r_9,
__r_10
}
},
{
71,
80,
{
{
21672,
45
},
{
139,
4500
},
__r_9,
__r_10
}
},
{
81,
90,
{
{
21672,
40
},
{
139,
4000
},
__r_9,
__r_10
}
},
{
91,
100,
{
{
21672,
35
},
{
139,
3500
},
{
16021,
60
},
{
21002,
60
}
}
},
{
101,
110,
{
{
21672,
30
},
{
139,
3000
},
{
16021,
50
},
{
21002,
50
}
}
},
{
111,
120,
{
{
21672,
25
},
{
139,
2500
},
__r_11,
__r_12
}
},
{
121,
130,
{
{
21672,
20
},
{
139,
2000
},
__r_11,
__r_12
}
},
{
131,
140,
{
{
21672,
15
},
{
139,
1500
},
__r_13,
__r_14
}
},
{
141,
150,
{
{
21672,
10
},
{
139,
1000
},
__r_13,
__r_14
}
},
{
151,
300,
{
{
21672,
5
},
{
139,
500
},
__r_13,
__r_14
}
}
},
id=1,
log_max_cnt=50,
open_conf={
{
1
}
},
open_pf_list={
[6789]=1,
[7382]=1,
[8085]=1,
[8086]=1,
[8246]=1,
[8248]=1,
[8332]=1,
[8438]=1,
[8522]=1,
[8544]=1,
[8630]=1,
[8679]=1
},
open_server_days_fix={
{
0,
200,
1
},
{
201,
300,
1.1
},
{
301,
400,
1.2
},
{
401,
500,
1.3
},
{
501,
10000,
1.4
}
},
ruleCfg={
{
desc=__rs[1],
itemType=1
},
{
desc=__rs[2],
itemType=1
},
{
desc=__rs[3],
itemType=1
},
{
desc=__rs[4],
itemType=1
},
{
desc=__rs[5],
itemType=1
},
{
desc=__rs[6],
itemType=1
},
{
desc=__rs[7],
itemType=1
},
{
itemType=4,
title=__rs[8],
txt1=__rs[9],
txt2=__rs[10],
txt3=__rs[11]
},
{
itemType=4,
title=__rs[12],
txt1=__rs[13],
txt2=__rs[14],
txt3=__rs[15]
},
{
itemType=3,
title=__rs[16],
txt1=__rs[17],
txt2=__rs[18]
},
{
itemType=3,
title=__rs[19],
txt1=__rs[20],
txt2=__rs[21]
},
{
itemType=3,
title=__rs[22],
txt1=__rs[23],
txt2=__rs[24]
},
{
itemType=5,
title=__rs[25],
txt1=__rs[26],
txt2=__rs[27],
txt3=__rs[28],
txt4=__rs[29],
txt5=__rs[30]
},
{
itemType=5,
title=__rs[31],
txt1=__rs[32],
txt2=__rs[33],
txt3=__rs[34],
txt4=__rs[35],
txt5=__rs[36]
},
{
itemType=2,
title=__rs[37],
txt1=__rs[38]
},
{
itemType=6,
list={
__rs[40],
__rs[41],
__rs[42],
__rs[43],
__rs[44],
__rs[45],
__rs[46],
__rs[47],
__rs[48],
__rs[49],
__rs[50],
__rs[51],
__rs[52],
__rs[53],
__rs[54],
__rs[55],
__rs[56],
__rs[57],
__rs[58],
__rs[59]
},
title=__rs[39]
}
},
settle_time={
[7382]={
"2026-3-10 23:30:00",
"2026-3-10 23:59:00"
},
[8085]={
"2026-2-8  23:30:00",
"2026-2-8 23:59:00"
},
[8086]=__r_15,
[8246]=__r_15,
[8248]=__r_15,
[8332]=__r_15,
[8438]=__r_15,
[8522]=__r_15,
[8544]={
"2026-2-28 23:30:00",
"2026-2-28 23:59:00"
},
[8630]=__r_15,
[8679]=__r_15
}
}
}

return ___noname___
