

local __rs={
[1]="暴击几率 +8%",
[2]="如雷",
[3]="生命 +15%",
[4]="长生",
[5]="速度 +10%",
[6]="乘风",
[7]="效果抵抗 +20%",
[8]="明光",
[9]="反击伤害 +25%",
[10]="应报",
[11]="持续伤害 +25%",
[12]="宿命",
[13]="受到治疗效果 +20%",
[14]="生机",
[15]="暴击伤害 +20%",
[16]="雷霆",
[17]="暴击减伤 +30%",
[18]="御雷",
[19]="法宝技能威力 +12%",
[20]="宝光",
[21]="抗暴几率 +25%",
[22]="镇雷",
[23]="速度 +15%",
[24]="云行",
[25]="效果命中 +20%",
[26]="耀目",
[27]="效果抵抗 +30%",
[28]="仙光",
[29]="治疗效果 +25%",
[30]="愈灵",
[31]="物理伤害 +12%",
[32]="神威",
[33]="法术伤害 +12%",
[34]="仙威",
[35]="攻击 +10%",
[36]="神力",
[37]="伤害减免 +15%",
[38]="护道",
[39]="防御 +25%",
[40]="护持",
[41]="闪避 +15%",
[42]="幻影",
[43]="反射负面状态 +20%",
[44]="因果",
[45]="法宝蓄力加速 +30%",
[46]="灵动",
[47]="暴击几率+8% 造成暴击伤害时额外提升自身10%法宝蓄力，此效果每回合最多生效1次。",
[48]="生命+15%，暴击减伤+50%",
[49]="速度+10% 你的速度属性不会被减益状态降低",
[50]="暴击伤害+20% 攻击+10%",
[51]="治疗效果+25% 自身永久免疫【晕眩】、【冰封】、【混乱】状态",
[52]="法宝技能威力+12% 每次施展法宝神通后此效果叠加1层，最多可叠加10层",
[53]="攻击+10% 自身存活期间，除自身以外的所有队友攻击+10%",
[54]="闪避+15% 反射伤害减免+30%",
[55]="法宝蓄力加速+30% 每次施展法宝神通后，使自身职业技能、功法技能冷却时间降低1回合",
[56]="暴击率+8%，命中率+30%",
[57]="生命+15% 战斗开始时，获得相当于自身抗暴几率50%的额外效果命中",
[58]="反击伤害+25% 每次触发反击后，获得相当于生命15%的【护盾】",
[59]="暴击伤害+20% 每回合结束时按金、木、水、火、土顺序，凝聚1枚未曾获得的五彩神石",
[60]="抗暴几率+25% 受到物理伤害降低35%",
[61]="速度+15%，效果命中+50%",
[62]="物理伤害+12% 攻击忽略目标20%防御",
[63]="伤害减免+15% 施加护盾效果提升30%",
}
local __r_1={
201,
800
}
local __r_2={
__r_1
}
local __r_3={
303,
0.15
}
local __r_4={
__r_3
}
local __r_5={
{
304,
0.1
}
}
local __r_6={
{
225,
2500
}
}
local __r_7={
202,
2000
}
local __r_8={
__r_7
}
local __r_9={
{
219,
1200
}
}
local __r_10={
203,
2500
}
local __r_11={
304,
0.15
}
local __r_12={
{
209,
2500
}
}
local __r_13={
213,
1200
}
local __r_14={
301,
0.1
}
local __r_15={
__r_14
}
local __r_16={
212,
1500
}
local __r_17={
208,
1500
}
local __r_18={
{
222,
3000
}
}
local ___noname___=
{
{
attr=__r_2,
desc=__rs[1],
icon=25001,
id=1,
name=__rs[2]
},
{
attr=__r_4,
desc=__rs[3],
icon=25002,
id=2,
name=__rs[4]
},
{
attr=__r_5,
desc=__rs[5],
icon=25003,
id=3,
name=__rs[6]
},
{
attr={
{
206,
2000
}
},
desc=__rs[7],
icon=25004,
id=4,
name=__rs[8]
},
{
attr=__r_6,
desc=__rs[9],
icon=25005,
id=5,
name=__rs[10]
},
{
attr={
{
223,
2500
}
},
desc=__rs[11],
icon=25006,
id=6,
name=__rs[12]
},
{
attr={
{
210,
2000
}
},
desc=__rs[13],
icon=25007,
id=7,
name=__rs[14]
},
[21]={
attr=__r_8,
desc=__rs[15],
icon=25008,
id=21,
name=__rs[16]
},
[22]={
attr={
{
204,
3000
}
},
desc=__rs[17],
icon=25009,
id=22,
name=__rs[18]
},
[23]={
attr=__r_9,
desc=__rs[19],
icon=25010,
id=23,
name=__rs[20]
},
[24]={
attr={
__r_10
},
desc=__rs[21],
icon=25011,
id=24,
name=__rs[22]
},
[25]={
attr={
__r_11
},
desc=__rs[23],
icon=25012,
id=25,
name=__rs[24]
},
[26]={
attr={
{
205,
2000
}
},
desc=__rs[25],
icon=25013,
id=26,
name=__rs[26]
},
[27]={
attr={
{
206,
3000
}
},
desc=__rs[27],
icon=25014,
id=27,
name=__rs[28]
},
[28]={
attr=__r_12,
desc=__rs[29],
icon=25015,
id=28,
name=__rs[30]
},
[41]={
attr={
__r_13
},
desc=__rs[31],
icon=25016,
id=41,
name=__rs[32]
},
[42]={
attr={
{
215,
1200
}
},
desc=__rs[33],
icon=25017,
id=42,
name=__rs[34]
},
[43]={
attr=__r_15,
desc=__rs[35],
icon=25018,
id=43,
name=__rs[36]
},
[44]={
attr={
__r_16
},
desc=__rs[37],
icon=25019,
id=44,
name=__rs[38]
},
[45]={
attr={
{
302,
0.25
}
},
desc=__rs[39],
icon=25020,
id=45,
name=__rs[40]
},
[46]={
attr={
__r_17
},
desc=__rs[41],
icon=25021,
id=46,
name=__rs[42]
},
[47]={
attr={
{
224,
2000
}
},
desc=__rs[43],
icon=25022,
id=47,
name=__rs[44]
},
[48]={
attr=__r_18,
desc=__rs[45],
icon=25023,
id=48,
name=__rs[46]
},
[49]={
attr=__r_2,
desc=__rs[47],
icon=25001,
id=49,
name=__rs[2],
skill={
25625
}
},
[50]={
attr={
__r_3,
{
204,
5000
}
},
desc=__rs[48],
icon=25002,
id=50,
name=__rs[4]
},
[51]={
attr=__r_5,
desc=__rs[49],
icon=25003,
id=51,
name=__rs[6],
skill={
25627
}
},
[52]={
attr={
__r_7,
__r_14
},
desc=__rs[50],
icon=25008,
id=52,
name=__rs[16]
},
[53]={
attr=__r_12,
desc=__rs[51],
icon=25015,
id=53,
name=__rs[30],
skill={
25628
}
},
[54]={
attr=__r_9,
desc=__rs[52],
icon=25010,
id=54,
name=__rs[20],
skill={
25630
}
},
[55]={
attr=__r_15,
desc=__rs[53],
icon=25018,
id=55,
name=__rs[36],
skill={
25632
}
},
[56]={
attr={
__r_17,
{
240,
3000
}
},
desc=__rs[54],
icon=25021,
id=56,
name=__rs[42]
},
[57]={
attr=__r_18,
desc=__rs[55],
icon=25023,
id=57,
name=__rs[46],
skill={
25633
}
},
[58]={
attr={
__r_1,
{
207,
3000
}
},
desc=__rs[56],
icon=25001,
id=58,
name=__rs[2]
},
[59]={
attr=__r_4,
desc=__rs[57],
icon=25002,
id=59,
name=__rs[4],
skill={
25721
}
},
[60]={
attr=__r_6,
desc=__rs[58],
icon=25005,
id=60,
name=__rs[10],
skill={
25722
}
},
[61]={
attr=__r_8,
desc=__rs[59],
icon=25008,
id=61,
name=__rs[16],
skill={
25637
}
},
[62]={
attr={
__r_10,
{
214,
3500
}
},
desc=__rs[60],
icon=25011,
id=62,
name=__rs[22]
},
[63]={
attr={
__r_11,
{
205,
5000
}
},
desc=__rs[61],
icon=25012,
id=63,
name=__rs[24]
},
[64]={
attr={
__r_13,
{
234,
2000
}
},
desc=__rs[62],
icon=25016,
id=64,
name=__rs[32]
},
[65]={
attr={
__r_16,
{
231,
3000
}
},
desc=__rs[63],
icon=25019,
id=65,
name=__rs[38]
},
[66]={
attr=__r_18,
desc=__rs[55],
icon=25023,
id=66,
name=__rs[46],
skill={
25724
}
}
}
___noname___.const_def=
{
pos={
13,
14,
15
}
}

return ___noname___
