

local __rs={
[1]="1.祖师可通过该建筑安排一名弟子传功给另外一名弟子，传功完成后传功弟子的<color=red>境界和炼体会降至凡人</color>，而受功弟子的<color=#CA631D>境界和炼体均取两名弟子中的最高等级</color>\n2.传功弟子的<color=#CA631D>境界或炼体必须有一项比受功弟子要高</color>才可进行传功，传功完成后传功弟子会卸下所有<color=#CA631D>装备</color>、<color=#CA631D>法宝</color>、<color=#CA631D>符宝</color>以及<color=#CA631D>返还对应数量天命灵魄</color>\n3.若传功弟子为<color=#CA631D>仙缘弟子</color>，则返还的是该弟子的<color=#CA631D>专属天命灵魄</color>而非<color=#CA631D>混沌天命灵魄</color>\n4.传功需要<color=#CA631D>消耗灵玉</color>，传功弟子的境界或炼体越高，则传功所需要消耗的灵玉数量越多\n5.传功弟子的境界达到元婴或炼体达到凝脉时，传功完成后传功弟子会获得<color=red>持续一段时间的道劫</color>，道劫无法在律法堂里被移除\n6.获得道劫的弟子<color=red>资质和根骨会下降</color>且<color=red>无法再次成为传功弟子</color>\n7.完成问心关的弟子进行传功，将会重置问心关，返还所有材料与75%的传道点数\n8.已完成转职的弟子进行传功，将会自动斩念重修，返还心法修炼中所有的突破材料与75%的仙魔气",
[2]="境界传功",
[3]="1.祖师可通过该建筑安排一名弟子传功给另外一名弟子，传功完成后传功弟子的<color=red>各项专业技能会降至0级</color>，而受功弟子的<color=#CA631D>各项专业技能等级均取两名弟子中的最高等级</color>\n2.传功弟子的<color=#CA631D>专业技能等级必须有一项比受功弟子要高</color>才可进行传功\n3.传功需要<color=#CA631D>消耗灵玉</color>，受功弟子专业技能等级提升越多，则传功所需要消耗的灵玉数量越多\n",
[4]="技能传功",
[5]="1.放映厅活动共有21幕，每一幕都对应一张经典电影镜头。点击剧幕，你将展开一段角色剧情的对白或玩法挑战。\n2.每一幕都隐藏着独特的剧情和挑战，尽情探索，享受电影与游戏的完美结合。\n3.玩法内容丰富多样，主要包括：\n（1）挑战怪物：挑战电影中出现的经典怪物，推进剧情\n（2）答题：回顾电影中的经典对白\n（3）小游戏：参与趣味小游戏，享受轻松愉快的游戏时光\n（4）秘境探险：探索神秘秘境，发现隐藏的宝藏和奇遇事件\n4.活动奖励：完成所有21幕剧幕后，你的放映进度将达到100%，届时你将获得一份奖励。",
[6]="规则介绍",
[7]="1.剧情模式：通关后即算完成当前剧目的探索，推进放映进度，通关后即开启挑战模式\n2.挑战模式：通关后仅获得额外挑战奖励，不影响放映进度\n3.通关目标为击败所有怪物\n4.关卡按顺序挑战，无法跳关，挑战胜利后无法重复挑战",
[8]="1.放映厅活动共有12幕，每一幕都对应一张经典桥段。点击剧幕，你将展开一段角色剧情的对白或玩法挑战。\n2.每一幕都隐藏着独特的剧情和挑战，尽情探索，享受原著与游戏的完美结合。\n3.玩法内容丰富多样，主要包括：\n（1）挑战怪物：挑战原著中出现的经典怪物，推进剧情\n（2）答题：回顾原著中的经典对白\n（3）小游戏：参与趣味小游戏，享受轻松愉快的游戏时光\n（4）秘境探险：探索神秘秘境，发现隐藏的宝藏和奇遇事件\n4.活动奖励：完成所有12幕剧幕后，你的放映进度将达到100%，届时你将获得一份奖励。",
[9]="1.祖师可通过该建筑安排一只灵兽传功给另外一只灵兽，传功完成后传功灵兽的<color=red>境界会降至通智</color>，而受功灵兽的<color=#CA631D>境界取两只灵兽中的最高等级</color>。\n2.传功灵兽的<color=#CA631D>境界必须比受功灵兽要高</color>才可进行传功。\n3.传功需要<color=#CA631D>消耗灵玉</color>，传功灵兽提升的潜力值、主动技能等级、血脉等级越高，消耗的灵玉越高，受功灵兽改变的境界等级越高，消耗的灵玉越高。\n4.传功灵兽的境界达到元婴时，传功完成后传功灵兽会获得<color=red>持续一段时间的资质受损</color>。\n5.获得资质受损的灵兽的<color=red>资质会下降</color>且<color=red>无法再次成为传功灵兽</color>。\n6.受功灵兽只会继承传功灵兽的境界，无法继承传功灵兽的主动技能等级、血脉等级、潜力值。\n7.若传功灵兽提升了潜力，将会重置潜力值，返还所有消耗的材料。\n8.若传功灵兽升级了主动技能，将会重置主动技能等级，返还<color=#CA631D>所有消耗的技能书</color>，<color=#CA631D>不返还</color>灵石。\n9.若传功灵兽升级了血脉，将会重置血脉等级，返还<color=#CA631D>所有消耗的灵兽</color>与<color=#CA631D>100%</color>对应的五行精魄。",
[10]="灵兽传功",
}
local ___noname___=
{
{
desc=__rs[1],
id=1,
title=__rs[2]
},
{
desc=__rs[3],
id=2,
title=__rs[4]
},
{
desc=__rs[5],
id=3,
title=__rs[6]
},
{
desc=__rs[7],
id=4,
title=__rs[6]
},
{
desc=__rs[8],
id=5,
title=__rs[6]
},
{
desc=__rs[7],
id=6,
title=__rs[6]
},
{
desc=__rs[9],
id=7,
title=__rs[10]
}
}

return ___noname___
