

local __rs={
[1]="兽友，你口水流我袍子上了！#13",
[2]="这食盆比我的饭碗还精致！祖师偏心！#1",
[3]="清理便便也是修行…嗯，一定是！#30",
[4]="再蹭我，工钱你付啊？",
[5]="吃饱就睡？比我还会享受！",
[6]="别用那种眼神看我，真没灵石了！",
[7]="合作愉快！下次给你加餐~",
[8]="它好像…在鄙视我的手法？#24",
[9]="再拱我腰就当坐骑征用了！#19",
[10]="灵丹消化没？运动时间到！#27",
[11]="撒娇也没用，今日不许加餐！",
[12]="这窝乱的…是刚打完仗吗？#8",
[13]="虽然累，但看到它们开心就值得了~#23",
[14]="哎哟，这小眼神，谁顶得住啊！#9",
[15]="灵兽拆家实录…祖师报销吗？",
}
local __r_1={
__rs[1],
__rs[2],
__rs[3],
__rs[4],
__rs[5],
__rs[6],
__rs[7],
__rs[8],
__rs[9],
__rs[10],
__rs[11],
__rs[12],
__rs[13],
__rs[14],
__rs[15]
}
local ___noname___=
{
{
id=1,
move_cd=3,
move_rate=0.5,
speak_1=__r_1,
speak_2=__r_1,
speak_cd=3,
speak_rate=0.5,
ui_move_cd=3,
ui_move_rate=0.5,
ui_speak_1=__r_1,
ui_speak_2=__r_1,
ui_speak_cd=3,
ui_speak_rate=0.5
}
}

return ___noname___
