

local __rs={
[1]="一株沾染了仙灵之气的灵草，极其罕见，其周围弥漫着勃勃生机。将此物作为兽栏装饰物时，会给予所在兽栏【木】、【土】属性，并且可以提高所在兽栏中灵兽的修炼速度",
[2]="仙灵草",
[3]="透过此石可以瞧见灵气有如实体般在空中浮动。将此物作为兽栏装饰物时，可以提高所在兽栏中灵兽的修炼速度",
[4]="天眼石",
[5]="其内掺入了些许未知石料的有瑕之玉，可以引动四周水汽，使周围雾气弥漫。将此物作为兽栏装饰物时，会给予所在兽栏【水】属性",
[6]="有瑕玉",
}
local ___noname___=
{
[15201]={
add_effect={
{
2,
5
},
{
800
}
},
desc=__rs[1],
id=15201,
ldId=1,
name=__rs[2]
},
[15202]={
add_effect={
[2]={
500
}
},
desc=__rs[3],
id=15202,
ldId=1,
name=__rs[4]
},
[15203]={
add_effect={
{
3
}
},
desc=__rs[5],
id=15203,
ldId=1,
name=__rs[6]
}
}

return ___noname___
