

local __rs={
[1]="尊敬的祖师大人：\n        感谢您参与体验山海世界玩法，山海世界目前处于测试阶段，活动的玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[2]="尊敬的祖师大人：\n        感谢您参与体验商市玩法，该玩法目前处于测试阶段，活动的玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[3]="尊敬的祖师大人：\n        感谢您参与体验一方灵田玩法，该玩法目前处于测试阶段，玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[4]="尊敬的祖师大人：\n        感谢您参与体验云上仙行玩法，该玩法目前处于测试阶段，玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[5]="尊敬的祖师大人：\n        感谢您参与体验问鼎苍穹玩法，该玩法目前处于测试阶段，玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[6]="尊敬的祖师大人：\n        感谢您参与体验仙域玩法，该玩法目前处于测试阶段，玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
[7]="尊敬的祖师大人：\n        感谢您参与体验仙界玩法，该玩法目前处于测试阶段，玩法规则和产出奖励可能会随着更新而发生变化。\n        我们非常重视您的意见和建议，如您在游玩过程中有任何想法或意见，都可以随时告诉我们，猫子们将会认真阅读您的来信，并积极考虑您的建议。\n        向您致以诚挚的谢意，我们会持续努力，为您提供更好的游玩体验。",
}
local __r_1={
2024,
9,
30,
23,
59,
59
}
local __r_2={
{
2024,
11,
29,
0,
0,
0
},
{
2025,
2,
28,
23,
59,
59
}
}
local ___noname___=
{
{
desc=__rs[1],
id=1,
reward=32,
time={
{
2024,
5,
6,
0,
0,
0
},
{
2024,
6,
30,
23,
59,
59
}
}
},
{
desc=__rs[2],
id=2,
reward=26,
time={
{
2024,
4,
1,
0,
0,
0
},
{
2024,
4,
30,
23,
59,
59
}
}
},
{
desc=__rs[3],
id=3,
reward=63,
time={
{
2024,
7,
26,
0,
0,
0
},
__r_1
}
},
{
desc=__rs[4],
id=4,
reward=64,
time={
{
2024,
8,
7,
0,
0,
0
},
__r_1
}
},
{
desc=__rs[5],
id=5,
reward=65,
time={
{
2024,
9,
19,
0,
0,
0
},
{
2024,
11,
30,
23,
59,
59
}
}
},
{
desc=__rs[6],
id=6,
reward=71,
time=__r_2
},
{
desc=__rs[7],
id=7,
reward=72,
time=__r_2
}
}

return ___noname___
