

local __rs={
[1]="拨开草丛的瞬间，一缕仙灵之气逸散而出，些许遗留仙气飘入葫口。<color=#CA631D>【捉妖葫品质提升】</color>",
[2]="草叶间窜出几点荧光，如流萤般绕着抓妖葫飞旋，最终化作一缕青气钻入葫口。<color=#CA631D>【捉妖葫品质提升】</color>",
[3]="黑影从草丛中窜出，原地留下一个布包—打开竟是【{0}】！布包角落绣着小小的“赠”字，像是哪位路过的修士遗落的。",
[4]="抓妖葫探入草丛时，葫口突然“咔哒”一声卡住了什么—拽出来一看，是挂在草茎上的【{0}】，上面还沾着几片嫩绿的草叶。",
[5]="拨开草丛，不见灵兽身影，地上散落着几枚鸟羽，捉妖葫探过时，羽尖突然亮起银芒，朝葫口聚拢。<color=#CA631D>【捉妖葫+1】</color>",
[6]="拨开草丛的瞬间，黑影消失不见，原地留下一撮带光泽的兽毛，捉妖葫靠近时，兽毛悠悠飘入葫口。<color=#CA631D>【捉妖葫+1】</color>",
[7]="拨开草丛，一只灵兽抱着尾巴蜷缩其中，被你惊扰后猛地窜起，却不小心撞到了抓妖葫的葫口……<color=#CA631D>【灵兽捕捉成功】</color>",
[8]="草丛里传来窸窣声，一只毛绒绒的耳朵先探了出来，灵兽警惕地嗅了嗅空气，在看到抓妖葫时，竟主动凑上前去…...<color=#CA631D>【灵兽捕捉成功】</color>",
}
local ___noname___=
{
{
content=__rs[1],
id=1,
logType=1
},
{
content=__rs[2],
id=2,
logType=1
},
{
content=__rs[3],
id=3,
logType=2
},
{
content=__rs[4],
id=4,
logType=2
},
{
content=__rs[5],
id=5,
logType=3
},
{
content=__rs[6],
id=6,
logType=3
},
{
content=__rs[7],
id=7,
logType=4
},
{
content=__rs[8],
id=8,
logType=4
}
}

return ___noname___
