

local __rs={
[1]="该弟子拥有稀有的<color=#6833c0>傲人</color>品质，拒招后弟子消失，确定拒招吗？",
[2]="该弟子拥有稀有的<color=#ca631d>绝伦</color>品质，拒招后弟子消失，确定要拒招吗？",
[3]="该弟子拥有稀有的<color=#c82c2c>逆天</color>品质，拒招后弟子消失，确定要拒招吗？",
[4]="以职业和灵根为条件，可在附庸家族中选拔弟子",
[5]="家族招募颇为耗时，师尊还请耐心等待",
[6]="尚有弟子未收入宗门，确定继续招募吗？",
[7]="尚有<color=#6833c0>紫色</color>弟子未收入宗门，是否要继续招募？",
[8]="尚有<color=#ca631d>橙色</color>弟子未收入宗门，是否要继续招募？",
[9]="尚有<color=#c82c2c>红色</color>弟子未收入宗门，是否要继续招募？",
}
local ___noname___=
{
{
giveup_tips={
{
3,
__rs[1]
},
{
4,
__rs[2]
},
{
5,
__rs[3]
}
},
id=1,
jz_speak={
__rs[4],
__rs[5]
},
skip_animation_count=80,
skip_animation_lv=20,
tips={
{
0,
__rs[6]
},
{
3,
__rs[7]
},
{
4,
__rs[8]
},
{
5,
__rs[9]
}
}
}
}

return ___noname___
